raohassandev/LPG-Filling-ESP/firmware/lpg_display/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# CPU — 240 MHz
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# OPI PSRAM (8 MB)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# FreeRTOS — 1 ms tick
CONFIG_FREERTOS_HZ=1000

# USB-Serial/JTAG console (Waveshare ESP32-S3 USB-C programming/debug port)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_USB_CDC=n

# RGB LCD — IRAM safe ISR disabled (lvgl_port vsync callback not IRAM_ATTR)
CONFIG_LCD_RGB_ISR_IRAM_SAFE=n

# Stack overflow detection
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# LVGL — Montserrat fonts used by Theme.h
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# LVGL — flex layout used in Theme.h widgets
CONFIG_LV_USE_FLEX=y

# LVGL — enable float support in lv_label_set_text_fmt / lv_snprintf
CONFIG_LV_SPRINTF_USE_FLOAT=y

# WiFi
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP32_WIFI_NVS_ENABLED=y

# NVS (needed by WifiManager)
CONFIG_NVS_ASSERT_ERROR_CHECK=n
